EMS/DataProcessors/EMS_ПроверкаСинхронизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>EMS_ПроверкаСинхронизации</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

EMS/InformationRegisters/EMS_ОбъектыМетаданных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>EMS_ОбъектыМетаданных</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выбран</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Иерархический</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолеОрганизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПараметрыБазы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.EMS_ПараметрыБаз</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

EMS/DataProcessors/EMS_ПроверкаСинхронизации/Forms/Форма/Ext/Form/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Логин = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СинхронизацияEMS", "Логин");
	Пароль = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища("СинхронизацияEMS", "Пароль");
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы
    
&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры  

&НаКлиенте
Процедура КопироватьСтрокуДляВсехБаз(Команда)
	КопироватьСтрокуДляВсехБазНаСервере(); 
	Элементы.ОбъектыМетаданных.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьСписокОбъектНеНайденДляБазы(Команда) 
	ТаблицаСообщений = Элементы.СообщенияСинхронизации;
	ТекущаяСтрока = ТаблицаСообщений.ТекущиеДанные;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗначениеБазы = ТекущаяСтрока.База;
	ТабДокумент = Новый ТабличныйДокумент;
	ПолучитьСписокОбъектНеНайденДляБазыНаСервере(ТабДокумент, ЗначениеБазы);
	ТабДокумент.Показать("Результаты обработки сообщений");

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура СохранитьНаСервере()
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("СинхронизацияEMS", Логин, "Логин");
	ОбщегоНазначения.ЗаписатьДанныеВБезопасноеХранилище("СинхронизацияEMS", Пароль, "Пароль");
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьСинхронизацию(Команда)
	ПроверитьСинхронизациюНаСервере();  
	Элементы.СообщенияСинхронизации.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ПроверитьСинхронизациюНаСервере()
	EMS_ПроверкаСинхронизации.ВыполнитьСинхронизацию(Истина);
КонецПроцедуры

&НаСервере
Процедура КопироватьСтрокуДляВсехБазНаСервере()
	КлючЗаписи = Элементы.ОбъектыМетаданных.ТекущаяСтрока;
	Если КлючЗаписи = Неопределено Тогда
		Возврат;	
	КонецЕсли;   
	МенеджерЗаписи = РегистрыСведений.EMS_ОбъектыМетаданных.СоздатьМенеджерЗаписи();
    ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючЗаписи);
    МенеджерЗаписи.Прочитать();
	АктуальныеБазы = Справочники.EMS_ПараметрыБаз.СписокАктуальныхБаз();
	НаборЗаписей = РегистрыСведений.EMS_ОбъектыМетаданных.СоздатьНаборЗаписей();
	НаложитьОтборНаНаборЗаписей(НаборЗаписей, КлючЗаписи);  
	ЗаполнитьНаборЗаписей(НаборЗаписей, АктуальныеБазы, МенеджерЗаписи);
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
КонецПроцедуры    

Процедура НаложитьОтборНаНаборЗаписей(НаборЗаписей, КлючЗаписи)
	МетаданныеРегистра = Метаданные.РегистрыСведений.EMS_ОбъектыМетаданных;
	Для Каждого Измерение Из МетаданныеРегистра.Измерения Цикл
		Если Измерение.Имя <> "ПараметрыБазы" И КлючЗаписи[Измерение.Имя] <> Неопределено Тогда
			НаборЗаписей.Отбор[Измерение.Имя].Установить(КлючЗаписи[Измерение.Имя]);
		КонецЕсли;
	КонецЦикла;		
КонецПроцедуры  

Процедура ЗаполнитьНаборЗаписей(НаборЗаписей, АктуальныеБазы, МенеджерЗаписи) 
	Для Каждого ПараметрыБазы Из АктуальныеБазы Цикл
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ПараметрыБазы = ПараметрыБазы;
		ЗаполнитьЗначенияСвойств(НоваяЗапись, МенеджерЗаписи, , "ПараметрыБазы");
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПолучитьСписокОбъектНеНайденДляБазыНаСервере(ТабДокумент, ЗначениеБазы)	

    ТабДокумент.Область("R1C1").Текст = "Результаты обработки сообщений синхронизации";
	ТабДокумент.Область("R2C1").Текст = "";
	ТабДокумент.Область("R3C1").Текст = "База: " + ЗначениеБазы;
	ТабДокумент.Область("R4C1").Текст = "";
	ТабДокумент.Область("R5C1").Текст = "№";
	ТабДокумент.Область("R5C2").Текст = "Извлеченное сообщение";
	ТабДокумент.Область("R6C1").Текст = "";
	
	РегулярноеВыражение = "<Объект не найден> \([^)]*\)";
	НомерСтроки = 0;
	ТекущаяСтрокаТД = 7;
	
	ИсполняемаяСхема = Элементы.СообщенияСинхронизации.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	ИсполняемыеНастройки = Элементы.СообщенияСинхронизации.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
		ИсполняемыеНастройки.Отбор,
		"База",
		ЗначениеБазы,
		ВидСравненияКомпоновкиДанных.Равно);
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(ИсполняемаяСхема, ИсполняемыеНастройки, , , 
		Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(ТаблицаРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	Для Каждого СтрокаТаблицы Из ТаблицаРезультат Цикл
		
		ТекстСообщения = СтрокаТаблицы.Сообщение;
		РезультатПоиска = СтрНайтиВсеПоРегулярномуВыражению(ТекстСообщения, РегулярноеВыражение);
		
		Если РезультатПоиска <> Неопределено Тогда
			
			Для Каждого Совпадение Из РезультатПоиска Цикл
				
				НомерСтроки = НомерСтроки + 1;
				НайденнаяПодстрока = Сред(ТекстСообщения, Совпадение.НачальнаяПозиция, Совпадение.Длина);
				
				ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C1").Текст = Строка(НомерСтроки);
				ТабДокумент.Область("R" + Формат(ТекущаяСтрокаТД, "ЧГ=0") + "C2").Текст = НайденнаяПодстрока;
				
				ТекущаяСтрокаТД = ТекущаяСтрокаТД + 1;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;	
	ТабДокумент.АвтоМасштаб = Истина;	
КонецПроцедуры
#КонецОбласти
